# LineLoadNotOverlappingHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..LineLoadNotOverlappingHost Property
BuiltInFailures..::..LoadFailures Class See Also
---
Line load is not overlapping with its entire distribution its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LineLoadNotOverlappingHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LineLoadNotOverlappingHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LineLoadNotOverlappingHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace